package Basic.NumType;

import java.util.Scanner;

/**需求接收用户输入的年份,判断是平年还是闰年
 * 如果年份是闰年,只要满足以下两个条件其中之一即可
 * 1.能被4整除,并且不能被100整除
 * 2.能被400整除
 * */
public class Year {
    public static void main(String[] args) {
        //1.提示并接收用户输入的年份
        System.out.println("请输入您要判断的年份:");
        int year = new Scanner(System.in).nextInt();

        //2.0定义一个用来保存结果的变量
        String result = "平年";//设置默认值,假设每年都是平年
        //2.判断用于输入的年份是否满足闰年的条件
        //2.1判断结构 if(判断条件){满足条件后要执行的代码}
        /**处理方案一*/
//      /**条件1*/
//      if(year%4 == 0) {//能被4整除
//          if(year%100 != 0) {//并且不能被100整除
//              result = "闰年";//符合闰年条件,修改结果的默认值
//          }
//      }

//      /**条件二*/
//      if(year%400 == 0) {//能被400整除
//          result = "闰年";//符合闰年条件,修改结果的默认值
//      }

        /**处理方案二*/
        //1.能被4整除,并且不能被100整除
        //2.能被400整除
        //if(判断条件){满足条件后执行的代码}
        //if( (小条件1 && 小条件2) || 判断条件2){ 是闰年 }
        //if( (能被4整除 && 不能被100整除) || 能被400整除){ 是闰年 }
        if((year%4 == 0 && year%100 != 0) || year%400 == 0) {
            result = "闰年";
        }
        System.out.println(year+"年是"+result);
    }
}
